# Cvičení

## Titanic

V souboru [titanic.csv](data/titanic.csv) najdeš informace o cestujících na zaoceánském parníku Titanic.

In [1]:
import pandas

# načtení dat
data = pandas.read_csv("titanic.csv")

# vytvoření kontingenční tabulky
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Sex", columns=["Survived"], aggfunc=len)
titanic_pivot_table

Survived    0    1
Sex
female     81  233
male      464  109

In [2]:
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Pclass", columns=["Survived"], aggfunc=len)
titanic_pivot_table

Survived    0    1
Pclass
1          80  136
2          97   87
3         368  119

In [3]:
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Sex", columns=["Survived"], aggfunc=len, margins=True)
titanic_pivot_table = titanic_pivot_table.div(titanic_pivot_table.iloc[:,-1], axis=0)
titanic_pivot_table

Survived         0         1  All
Sex
female    0.257962  0.742038  1.0
male      0.809773  0.190227  1.0
All       0.614431  0.385569  1.0

In [4]:
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Pclass", columns=["Survived"], aggfunc=len, margins=True)
titanic_pivot_table = titanic_pivot_table.div(titanic_pivot_table.iloc[:,-1], axis=0)
titanic_pivot_table

Survived         0         1  All
Pclass
1         0.370370  0.629630  1.0
2         0.527174  0.472826  1.0
3         0.755647  0.244353  1.0
All       0.614431  0.385569  1.0

In [8]:
# děti, teenageři, dospělí a senioři
df_titanic_Pclass_1 = data[data["Pclass"] == 1]
df_titanic_Pclass_1 = df_titanic_Pclass_1.reset_index()
df_titanic_Pclass_1["age_group"] = pandas.cut(df_titanic_Pclass_1["Age"], [0, 12, 20, 60, float("inf")], labels=["children", "teenagers", "adults", "senior citizens"])
titanic_pivot_table = pandas.pivot_table(df_titanic_Pclass_1, values="Name", index="age_group", columns=["Survived"], aggfunc=len)
titanic_pivot_table

Survived          0    1
age_group
children          1    3
teenagers         3   14
adults           64  116
senior citizens  12    3